{"status":"ok","totalResults":37,"articles":[{"author":null,"title":"Sister Wives: Kody Brown Details Meeting Christine's Husband David - Entertainment Tonight","description":"'Sister Wives' star Kody Brown is calling out his ex-wife, Christine Brown. During part 4 of the 'Sister Wives’ one-on-one special on TLC, Kody details his f..."},{"author":"Haley Britzky","title":"US warship responds to an attack on commercial ship in Red Sea - CNN","description":"The USS Carney responded Monday to a distress call from a commercial vessel after it was attacked by “multiple projectiles” in the southern Red Sea, a US military official said."},{"author":"Caitlin O'Kane","title":"She bought a vase at Goodwill for $3.99. It was a rare piece that just sold at auction for more than $100,000. - CBS News","description":"A rare vase by Italian architect Carlo Scarpa recently sold at auction for $107,100 — even though it went for just $3.99 at Goodwill."},{"author":"Reuters","title":"Vatican approves blessings for same-sex couples in landmark ruling - Reuters","description":null},{"author":null,"title":"Gazans trapped in church fear being shot, says relative - BBC.com","description":"Two women were killed inside the Holy Family Church by sniper fire, a top Catholic cleric says."},{"author":null,"title":"Michelle Mone hits back at Rishi Sunak over PPE scandal - BBC.com","description":"The peer says she was \"honest\" with the government over contracts for personal protective equipment."},{"author":"Eric Lagatta","title":"How do ISS tomatoes lost in space for 8 months look? NASA shares photo - USA TODAY","description":"Astronaut Frank Rubio was blamed for eating missing tomatoes until they were found on the International Space Station. Now, NASA has released a photo."},{"author":"","title":"MLB rumors: Yoshinobu Yamamoto latest with Mets, Yankees in pursuit, Astros getting calls on Framber Valdez - CBS Sports","description":"Yamamoto is the hottest name in MLB free agency this week"},{"author":"Josh Schafer","title":"Goldman Sachs boosts 2024 S&P 500 target on increased confidence for Fed rate cuts in March - Yahoo Finance","description":"With more interest rate cuts expected to come in 2024 than initially projected, Goldman Sachs believes the outlook for stocks next year will also be better."},{"author":"Charlie D'Agata, Steve Berriman","title":"See inside the biggest Hamas tunnel Israel's military says it has found in Gaza - CBS News","description":"Israeli forces say the biggest tunnel they've ever discovered, just 500 yards inside Gaza, reflects the challenges of hunting Hamas without harming hostages."},{"author":"Brian Heater","title":"Apple Watch Series 9 sales to be halted over patent dispute - TechCrunch","description":"Apple will be halting sales of its Series 9 smartwatch, TechCrunch has confirmed. The news, shared by 9to5Mac, follows an October ruling by the"},{"author":"Daniella Genovese","title":"Nearly 400K without power across Northeast after storms sweep through region - Fox Business","description":"Power outages swept across the Northeast into Monday morning after the region was hit with heavy rain and strong wind gusts. Hundreds of thousands were without power."},{"author":"Kristin Contino","title":"Blake Lively looks like a living Barbie as she reunites with America Ferrera and 'Traveling Pants' cast - Page Six","description":"The cast joined together to honor the “Ugly Betty” star as she received a Critics Choice Association Groundbreaker Award on Friday night in NYC."},{"author":"COLLEEN LONG","title":"Car plows into President Biden's motorcade in Delaware - The Associated Press","description":"Wilmington police say 46-year-old driver believed to be drunk accidentally plowed into a parked SUV that was guarding President Joe Biden’s motorcade Sunday night while the president was leaving a visit to his campaign headquarters. The president and first la…"},{"author":null,"title":"[Removed]","description":"[Removed]"},{"author":null,"title":"Webb rings in the holidays with the ringed planet Uranus - European Space Agency","description":"The NASA/ESA/CSA James Webb Space Telescope recently trained its sights on weird and enigmatic Uranus, an ice giant that orbits on its side. What Webb found is a dynamic world with rings, moons, storms and other atmospheric features&nbsp;– including a seasona…"},{"author":"Chris Rickert | Wisconsin State Journal","title":"Likely new dog illness showing up in Wisconsin; veterinarians urge caution - Madison.com","description":"\"Most likely, if I had to guess, it's a novel pathogen or maybe a virus that has changed or a bacteria that's changed,\" Poulsen said."},{"author":"Wes Davis, Jess Weatherbed","title":"US lawmakers push DOJ to investigate Apple following Beeper shutdowns - The Verge","description":"Two US senators and two representatives call for the DOJ to investigate the possibility that Apple’s treatment of the Beeper Mini messaging app is anticompetitive."},{"author":null,"title":"Christian Ziegler: Republican chairman in Florida suspended amid rape allegation - BBC.com","description":"Calls for Christian Ziegler's resignation grow after allegations he raped a woman he and his wife dated."},{"author":null,"title":"North Carolina basketball star Eric Montross dies at age 52 - ESPN","description":"Former North Carolina and NBA big man Eric Montross, who began treatment for cancer in March, died Sunday at the age of 52, his family announced."}],"fetched":1703017030167031}